#### RebarTrimExtendData Members

---

|  |
| --- |
| RebarTrimExtendData Class   Methods   Properties   See Also |

The  RebarTrimExtendData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddBarGeometry(IList Curve ) | Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
| Public method | AddBarGeometry(CurveLoop) | Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
| Public method | CanAddBarGeometry | Returns true if getNumberOfBarGeometry() is less than GetNumberOfBars(), false otherwise. |
| Public method | ClearAllAddedBarGeometry | This function will remove all bars geometry that were added by calling AddBarGeometry(). |
| Public method | CreateEndConstraint | Creates a constraint for the end handle of the rebar. This constraint will be set preferred after the API execution is finished successfully. |
| Public method | CreateStartConstraint | Creates a constraint for the start handle of the rebar. This constraint will be set preferred after the API execution is finished successfully. |
| Public method | Dispose | Releases all resources used by the  RebarTrimExtendData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAddedBarGeometry | Gets the added curves that will represent the bar at index barIndex. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetNumberOfBarGeometry | Gets the number of Bar Geometry that were added. |
| Public method | GetRebarUpdateCurvesData | Gets a class that contains information used as input and output for rebar free form calculation. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarTrimExtendData Class

Autodesk.Revit.DB.Structure Namespace